var keymap={
    "数与式": {
        "有理数": {
            "正数和负数": 100,
            "有理数": 100,
            "数轴": 100,
            "相反数": 100,
            "绝对值": 100,
            "有理数大小比较": 100,
            "有理数的加法": 100,
            "有理数的减法": 100,
            "有理数的加减混合运算": 100,
            "有理数的乘法": 100,
            "有理数的除法": 100,
            "有理数的乘方": 100,
            "非负数的性质：偶次方": 100,
            "有理数的混合运算": 100,
            "科学计数法": 100,
            "非负数的性质": 100
        },
        "无理数与实数": {
            "平方根": 100,
            "非负数的性质：算术平方根": 100,
            "立方根": 100,
            "无理数": 100,
            "实数": 100,
            "实数的运算": 100
        },
        "代数式": {
            "列代数式": 100,
            "代数式求值": 100,
            "同类项": 100,
            "规律型：数字的变化类": 100,
            "规律型：图形的变化类": 100
        },
        "整式": {
            "整式的加减": 100,
            "整式的加减—化简求值": 100,
            "单项式乘单项式": 100,
            "单项式乘多项式": 100,
            "多项式乘多项式": 100,
            "完全平方公式": 100,
            "平方差公式": 100,
            "整式的除法": 100,
            "整式的混合运算": 100,
            "幂的乘法、乘方和积的乘方": 100,
            "单项式与多项式": 100
        },
        "因式分解": {
            "因式分解的概念": 100,
            "因式分解-提公因式法": 100,
            "因式分解-运用公式法": 100,
            "因式分解-十字相乘法等": 100,
            "实数范围内分解因式": 100,
            "因式分解的综合运用": 100
        },
        "分式": {
            "分式的定义": 100,
            "分式的值": 100,
            "分式的基本性质": 100,
            "约分": 100,
            "通分": 100,
            "分式的乘除法": 100,
            "分式的加减法": 100,
            "分式的混合运算": 100,
            "分式的化简求值": 100,
            "零指数幂与负整数指数幂幂": 100
        },
        "二次根式": {
            "二次根式的定义": 100,
            "二次根式的性质与化简": 100,
            "二次根式的乘除法": 100,
            "二次根式的加减法": 100,
            "二次根式的混合运算": 100,
            "二次根式的化简求值": 100,
            "二次根式的综合运用": 100
        }
    },
    "方程与不等式": {
        "一元一次方程": {
            "方程的定义": 100,
            "等式的性质": 100,
            "一元一次方程的定义": 100,
            "解一元一次方程": 100,
            "特殊形式的一元一次方程": 100,
            "一元一次方程的应用": 100
        },
        "二元一次方程组": {
            "二元一次方程的定义": 100,
            "二元一次方程组的定义": 100,
            "解二元一次方程组": 100,
            "同解方程组": 100,
            "三元一次方程组": 100,
            "二元一次方程组的应用": 100
        },
        "一元二次方程": {
            "一元二次方程的定义": 100,
            "解一元二次方程-直接开平方法": 100,
            "解一元二次方程-配方法": 100,
            "解一元二次方程-公式法": 100,
            "解一元二次方程-因式分解法": 100,
            "根的判别式": 100,
            "根与系数的关系": 100,
            "一元二次方程的应用": 100,
            "一元二次方程的综合运用": 100
        },
        "分式方程": {
            "分式方程的定义": 100,
            "解分式方程": 100,
            "换元法解分式方程": 100,
            "分式方程的增根": 100,
            "分式方程的应用": 100
        },
        "不等式与不等式组": {
            "不等式的定义": 100,
            "不等式的性质": 100,
            "一元一次不等式的定义": 100,
            "解一元一次不等式": 100,
            "一元一次不等式的应用": 100,
            "一元一次不等式组的定义": 100,
            "解一元一次不等式组": 100,
            "一元一次不等式组的应用": 100,
            "不等式的综合应用": 100
        }
    },
    "函数": {
        "平面直角坐标系": {
            "点的坐标": 100,
            "规律型：点的坐标": 100,
            "坐标确定位置": 100,
            "坐标与图形性质": 100
        },
        "函数基础知识": {
            "常量与变量": 100,
            "函数的概念": 100,
            "函数的图象": 100,
            "动点问题的函数图象": 100,
            "函数的表示方法": 100,
            "分段函数": 100
        },
        "一次函数": {
            "一次函数的定义": 100,
            "正比例函数的定义": 100,
            "待定系数法求一次函数解析式": 100,
            "一次函数与一元一次方程": 100,
            "一次函数与一元一次不等式": 100,
            "一次函数与二元一次方程（组）": 100,
            "一次函数的应用": 100,
            "一次函数综合题": 100,
            "一次函数的图像与性质": 100,
            "一次函数图像的综合运用": 100,
            "正比例函数的图像与性质": 100
        },
        "反比例函数": {
            "反比例函数的定义": 100,
            "反比例函数系数k的几何意义": 100,
            "反比例函数图象上点的坐标特征": 100,
            "待定系数法求反比例函数解析式": 100,
            "反比例函数与一次函数的交点问题": 100,
            "根据实际问题列反比例函数关系式": 100,
            "反比例函数的应用": 100,
            "反比例函数综合题": 100,
            "反比例函数的图像与性质": 100
        },
        "二次函数": {
            "二次函数的定义": 100,
            "二次函数的图象": 100,
            "二次函数的性质": 100,
            "二次函数图象与系数的关系": 100,
            "二次函数图象与几何变换": 100,
            "二次函数的最值": 100,
            "待定系数法求二次函数解析式": 100,
            "二次函数的三种形式": 100,
            "二次函数与不等式（组）": 100,
            "根据实际问题列二次函数关系式": 100,
            "二次函数的应用": 100,
            "二次函数综合题": 100,
            "二次函数与一元二次方程的关系": 100
        }
    },
    "图形的性质": {
        "图形认识初步": {
            "几何体的展开图": 100,
            "直线、射线、线段": 100,
            "角的概念": 100,
            "方向角": 100,
            "角平分线的定义": 100,
            "角的计算": 100,
            "余角和补角": 100,
            "七巧板": 100,
            "图形的认识": 100,
            "线段的运算": 100,
            "计算器-角的换算": 100
        },
        "相交线与平行线": {
            "相交线": 100,
            "同位角、内错角、同旁内角": 100,
            "平行线": 100,
            "平行线的判定": 100,
            "平行线的性质": 100,
            "平行线的判定与性质的综合运用": 100,
            "平行线之间的距离": 100,
            "垂线": 100
        },
        "三角形": {
            "三角形": 100,
            "三角形的角平分线、中线和高": 100,
            "三角形三边关系": 100,
            "三角形内角和定理": 100,
            "三角形的外角性质": 100,
            "全等图形": 100,
            "全等三角形的性质": 100,
            "全等三角形的判定": 100,
            "角平分线的性质": 100,
            "线段垂直平分线的性质": 100,
            "等腰三角形的性质": 100,
            "等腰三角形的判定": 100,
            "等腰三角形的判定与性质的综合运用": 100,
            "等边三角形的性质": 100,
            "等边三角形的判定": 100,
            "等边三角形的判定与性质的综合运用": 100,
            "直角三角形的性质": 100,
            "含30度角的直角三角形": 100,
            "直角三角形斜边上的中线": 100,
            "勾股定理": 100,
            "勾股定理的逆定理": 100,
            "勾股定理的应用": 100,
            "平面展开-最短路径问题": 100,
            "等腰直角三角形": 100,
            "三角形中位线定理": 100,
            "全等三角形的判定与性质的综合运用": 100
        },
        "四边形": {
            "多边形": 100,
            "多边形的对角线": 100,
            "多边形内角与外角": 100,
            "平面镶嵌（密铺）": 100,
            "平行四边形的性质": 100,
            "平行四边形的判定": 100,
            "平行四边形的判定与性质": 100,
            "菱形的性质": 100,
            "菱形的判定": 100,
            "菱形的判定与性质的综合运用": 100,
            "矩形的性质": 100,
            "矩形的判定": 100,
            "矩形的判定与性质的综合运用": 100,
            "正方形的性质": 100,
            "正方形的判定": 100,
            "正方形的判定与性质的综合运用": 100,
            "梯形": 100,
            "直角梯形": 100,
            "等腰梯形的性质": 100,
            "等腰梯形的判定": 100,
            "梯形中位线定理": 100,
            "*平面向量": 100,
            "中点四边形": 100,
            "四边形综合题": 100
        },
        "圆": {
            "圆的认识": 100,
            "垂径定理": 100,
            "圆心角、弧、弦的关系": 100,
            "圆周角定理": 100,
            "相交弦定理": 100,
            "点与圆的位置关系": 100,
            "确定圆的条件": 100,
            "三角形的外接圆与外心": 100,
            "直线与圆的位置关系": 100,
            "切线的性质": 100,
            "切线的判定": 100,
            "切线的判定与性质的综合运用": 100,
            "弦切角定理": 100,
            "切线长定理": 100,
            "切割线定理": 100,
            "三角形的内切圆与内心": 100,
            "圆与圆的位置关系": 100,
            "正多边形和圆": 100,
            "弧长的计算": 100,
            "扇形面积的计算": 100,
            "圆锥的计算": 100,
            "圆柱的计算": 100,
            "圆的综合题": 100
        },
        "尺规作图": {
            "作图—基本作图": 100,
            "作图—复杂作图": 100,
            "作图—应用与设计作图": 100
        },
        "命题与证明": {
            "命题与定理": 100,
            "轨迹": 100
        }
    },
    "图形的变化": {
        "图形的对称": {
            "轴对称的性质": 100,
            "轴对称图形": 100,
            "坐标与图形变化-对称": 100,
            "轴对称的作图": 100,
            "轴对称-最短路线问题": 100,
            "翻折变换（折叠问题）": 100,
            "轴对称的应用": 100
        },
        "图形的平移": {
            "生活中的平移现象": 100,
            "平移的性质": 100,
            "坐标与图形变化-平移": 100,
            "平移的应用": 100
        },
        "图形的旋转": {
            "生活中的旋转现象": 100,
            "旋转的性质": 100,
            "旋转对称图形": 100,
            "中心对称": 100,
            "中心对称图形": 100,
            "关于原点对称的点的坐标": 100,
            "坐标与图形变化-旋转": 100,
            "作图-旋转变换": 100,
            "利用旋转设计图案": 100,
            "几何变换的类型": 100,
            "几何变换综合题": 100
        },
        "图形的相似": {
            "比例的性质": 100,
            "比例线段": 100,
            "平行线分线段成比例": 100,
            "相似图形": 100,
            "相似三角形的性质": 100,
            "相似三角形的判定": 100,
            "射影定理": 100,
            "相似三角形的判定与性质的综合运用": 100,
            "作图-相似与位似变换": 100,
            "相似形综合题": 100
        },
        "锐角三角函数": {
            "特殊角的三角函数值": 100,
            "解直角三角形": 100,
            "解直角三角形的应用": 100,
            "锐角三角函数的概念": 100
        },
        "投影与视图": {
            "简单几何体的三视图": 100,
            "作图-三视图": 100,
            "三视图的运用": 100,
            "平行投影与中心投影": 100
        }
    },
    "统计与概率": {
        "数据收集与处理": {
            "调查收集数据的过程与方法": 100,
            "频数与频率": 100,
            "频数（率）分布表": 100,
            "频数（率）分布直方图": 100,
            "统计表": 100,
            "抽样调查": 100,
            "统计图": 100
        },
        "数据分析": {
            "中位数": 100,
            "众数": 100,
            "极差": 100,
            "方差": 100,
            "数据分析的运用": 100,
            "平均数": 100
        },
        "概率": {
            "随机事件": 100,
            "列表法与树状图法": 100,
            "游戏公平性": 100,
            "利用频率估计概率": 100,
            "概率的基本概念": 100,
            "待定考点": 100
        }
    }
}
